---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.UnableToRemapDetails
source: html/734c2859-13fe-dbc6-8a2a-a98b8f82fbe8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.UnableToRemapDetails Property

Unable to create attached detail group in view '[View Name]' for the selected elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToRemapDetails { get; }
```